app/controllers/system/contracts_controller.rb

INSERT INTO "system_contracts" ("contract_no", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["contract_no", ""], ["start_date", "2015-08-09"], ["end_date", "2015-08-09"], ["created_at", "2015-08-09 23:33:39.025724"], ["updated_at", "2015-08-09 23:33:39.025724"]]
---
  def create
    @system_contract = System::Contract.new(system_contract_params)
	@start_date_google=system_contract_params["start_date(1i)"].to_s + '-' + system_contract_params["start_date(2i)"].to_s + '-' + system_contract_params["start_date(3i)"].to_s + 'T10:00:52-05:00'
	@end_date_google=system_contract_params["start_date(1i)"].to_s + '-' + system_contract_params["start_date(2i)"].to_s + '-' + system_contract_params["start_date(3i)"].to_s + 'T10:00:52-05:00'

	@start_date=Date.new(system_contract_params["start_date(1i)"].to_i,system_contract_params["start_date(2i)"].to_i,system_contract_params["start_date(3i)"].to_i)
	@end_date=Date.new(system_contract_params["end_date(1i)"].to_i,system_contract_params["end_date(2i)"].to_i,system_contract_params["end_date(3i)"].to_i)

	#ESTO SE VA DESCOMENTAR CUANDO SE INSERTE EL START_DATE Y EL END_DATE DEL FORMULARIO DE RENEWAL
	supplier = Catalogs::Supplier.find(system_contract_params[:supplier_id])
	@email = supplier.email
	#t0=Time.new(system_renewal_params["start_date(1i)"].to_i,system_renewal_params["start_date(2i)"].to_i,system_renewal_params["start_date(3i)"].to_i)
  #t1=Time.new(system_renewal_params["end_date(1i)"].to_i,system_renewal_params["end_date(2i)"].to_i,system_renewal_params["end_date(3i)"].to_i)
  puts 'Aki va el parametro start_date sssssssssssssssssssssssssssssssssss'
  #puts t1
  if params[:notification_date].nil? || params[:notification_date].empty?
    @recordar = @start_date - APP_CONFIG["production"][:notification_time].to_i.days # resta 1 semana
  else
    @recordar = @start_date - params[:notification_date].to_i.days
 end
  @recordar2 = @end_date - APP_CONFIG["production"][:notification_time].to_i.days
  puts 'aki va el recordatorio al iniciar la renovacion'
  puts @recordar
  puts 'aki terminaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa'
  puts @email

    respond_to do |format|
      if @system_contract.save

DELETE FROM "system_contracts" WHERE "system_contracts"."id" = $1  [["id", 1]]
---
  def destroy
    @system_contract.destroy