app/controllers/system/siteviews_controller.rb

  def create
    @system_siteview = System::Siteview.new(system_siteview_params)
      #visit=System::Contract.find(system_siteview_params[:contract_id])
	    #format=*params["recordar"].values.map(&:to_i)
	    #@recordar=Time.new(format[2],format[1],format[0],format[3],format[4])
	    #@email=visit.supplier.email
	    #puts 'AKI DEBE IR EL PARAMETRO RECORDAR ROOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOT'
	    #puts @recordar
	    #puts 'AKI VA EL CAMPO NOW TIME ROOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOT'
	    #puts Time.now
	    #puts 'AKI TERMINA IR EL PARAMETRO EMAIL ROOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOT'
	    #puts @email
respond_to do |format|
    if @system_siteview.save
---
INSERT INTO "system_siteviews" ("contract_id", "completed", "visit_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["contract_id", 1], ["completed", "f"], ["visit_date", "2015-08-11 17:12:00.000000"], ["created_at", "2015-08-11 17:12:40.588714"], ["updated_at", "2015-08-11 17:12:40.588714"]]