app/controllers/catalogs/devices_controller.rb

  def create
    @catalogs_device = Catalogs::Device.new(catalogs_device_params)

    respond_to do |format|
      if @catalogs_device.save
---
INSERT INTO "catalogs_devices" ("name", "unam_stock_number", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "IBM Server 2050"], ["unam_stock_number", "AB1"], ["location_id", 1], ["created_at", "2015-08-11 17:08:00.585606"], ["updated_at", "2015-08-11 17:08:00.585606"]]