app/controllers/catalogs/locations_controller.rb

INSERT INTO "catalogs_locations" ("department", "responsible", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @catalogs_location = Catalogs::Location.new(catalogs_location_params)

    respond_to do |format|
      if @catalogs_location.save