app/controllers/catalogs/suppliers_controller.rb

  def create
    @catalogs_supplier = Catalogs::Supplier.new(catalogs_supplier_params)

    respond_to do |format|
      if @catalogs_supplier.save
---
INSERT INTO "catalogs_suppliers" ("business_name", "contact", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @catalogs_supplier.update(catalogs_supplier_params)
---
UPDATE "catalogs_suppliers" SET "business_name" = $1, "contact" = $2, "email" = $3, "updated_at" = $4 WHERE "catalogs_suppliers"."id" = $5  [["business_name", "DELL"], ["contact", "dell coporation"], ["email", "soporte@dell.com.mx"], ["updated_at", "2015-08-11 17:10:54.633508"], ["id", 3]]